data/outputs/apache/test1.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        Apache/2.4.58
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.517 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      493000 bytes
HTML transferred:       223000 bytes
Requests per second:    284.33 [#/sec] (mean)
Time per request:       175.855 [ms] (mean)
Time per request:       3.517 [ms] (mean, across all concurrent requests)
Transfer rate:          136.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   5.2      2      34
Processing:    16  168  29.6    168     241
Waiting:        0   94  49.7     94     211
Total:         16  171  29.9    172     247

Percentage of the requests served within a certain time (ms)
  50%    172
  66%    180
  75%    187
  80%    191
  90%    204
  95%    219
  98%    225
  99%    234
 100%    247 (longest request)