data/outputs/apache/test4.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.1.133 (be patient)


Server Software:        Apache/2.4.58
Server Hostname:        192.168.1.133
Server Port:            80

Document Path:          /
Document Length:        223 bytes

Concurrency Level:      50
Time taken for tests:   3.405 seconds
Complete requests:      1000
Failed requests:        0
Total transferred:      493000 bytes
HTML transferred:       223000 bytes
Requests per second:    293.67 [#/sec] (mean)
Time per request:       170.261 [ms] (mean)
Time per request:       3.405 [ms] (mean, across all concurrent requests)
Transfer rate:          141.38 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   6.0      0      47
Processing:     0  163  25.0    164     211
Waiting:        0   92  48.6     94     203
Total:         16  166  25.0    169     211

Percentage of the requests served within a certain time (ms)
  50%    169
  66%    177
  75%    182
  80%    187
  90%    191
  95%    195
  98%    203
  99%    207
 100%    211 (longest request)